good_code_names = [
    # "仙坛股份", "金科股份", "南华仪器", "姚记科技", "中国化学", "中国平安", "万科A", "立讯精密", "劲嘉股份", "泸州老窖", "美的集团", "华东医药", "平安银行", "华兰生物", "五粮液", "北信源", "中孚信息", "山东药玻", "乐普医疗", "星宇股份", "长春高新",
    "平安银行", "万科A", "美的集团", "泸州老窖", "金科股份", "长春高新", "五粮液", "神火股份", "华东医药", "华兰生物", "正邦科技", "劲嘉股份", "立讯精密", "姚记科技", "牧原股份", "仙坛股份", "深南电路", "乐普医疗", "爱尔眼科", "东方财富", "泰格医药", "北信源", "我武生物", "南华仪器", "先导智能", "健帆生物", "欧普康视", "中孚信息", "药石科技", "上海机场", "恒瑞医药", "片仔癀", "贵州茅台", "山东药玻", "通策医疗", "中国化学", "中国平安", "星宇股份", "中国国旅", "海天味业", "绝味食品", "珀莱雅", "安图生物", "晨光文具", "益丰药房",
]

top_names = 
    '''
    '牧原股份', # 消费农产品
    '深南电路','生益电子', '沪电股份', # 5g pcb
    '赣锋锂业','天齐锂业', '亿纬锂能', '先导智能', # 锂电
    '立讯精密', # 电子汽车连接器
    '康拓红外', # 车辆运行安全检测装备
    '亨通光电', # 5g 光纤等待业绩反转
    '盈趣科技', # 电子烟,物联
    '恩捷股份',  # tesla: 湿法隔膜龙头）
    '璞泰来', #（电池负极龙头）；
    '中航高科', #航空复材预浸料的龙头企业，'
    贵州茅台 五粮液 格力电器 \
	东方财富 \
    正泰电器 \
	海天味业 五粮液 泸州老窖 万科Ａ  伊利股份  广州酒家  千禾味业 恒顺醋业 双汇发展 绝味食品 \
    美的集团 格力电器 苏泊尔 南华仪器 \
    天能动力 万华化学 星宇股份 \
    中国国旅 晨光文具  珀莱雅 \
	万科A 海螺水泥 上海机场 伟星新材 东方雨虹\
	浪潮信息 海康威视 立讯精密 海螺水泥 仙坛股份 中国平安 \
	立讯精密 维信诺 三利谱 深天马A 大族激光 中国长城 顺络电子 亿纬锂电 先导智能 天齐锂业 中国建筑 深信服 比亚迪 \
	片仔癀	长春高新 迈瑞医疗 复星医药 华大基因 恒瑞医药 爱尔眼科 迈瑞医疗 长春高新 药明康德 泰格医药 我武生物 通策医疗 安图生物 华兰生物 乐普医疗 \
	华东医药 泰格医药 健帆生物 安图生物 云南白药 欧普康视 山东药玻 药石科技 白云山 益丰药房 中炬高新 \
	 平安银行 招商银行 平安银行 兴业银行 药明康德 中国化学 中联重科,东方财富,苏宁易购 宁德时代,正海磁材,金科股份,姚记科技,东方电 子,神火股份,郎新科技,太钢不锈,北信源 劲嘉股份,正邦科技,中孚信息,海伦钢琴,牧原股份 招商轮船'
'''